[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:26:5
   // Stryker enable all
   // Stryker disable BooleanLiteral
   const columns = [
-    {
-      Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
-      disableGroupBy: true,
-      id: "quarter",
-
-      Cell: ({ cell: { value } }) => value,
-    },
+    {},
     {
       Header: "Course ID",
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:73:11
       Header: "Status",
       accessor: (row) => formatStatus(row.section),
       disableGroupBy: true,
-      id: "status",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-0-col-status"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
