[Killed] EqualityOperator
src/main/utils/sectionUtils.js:4:10
 import { hhmmTohhmma, convertToTimeRange } from "main/utils/timeUtils.js";
 
 export const convertToFraction = (en1, en2) => {
-  return en1 != null && en2 != null ? `${en1}/${en2}` : "";
+  return en1 == null && en2 != null ? `${en1}/${en2}` : "";
 };
 
killedBy: section utils tests convertToFraction one null test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null/100"

[Killed] ArithmeticOperator
src/main/utils/sectionUtils.js:33:9
           ? `${timeLocationArray[index].days}`
           : "";
       if (
-        index + 1 < timeLocationArray.length &&
+        index - 1 < timeLocationArray.length &&
         timeLocationArray[index].days !== null
       ) {
killedBy: section utils tests formatDays test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M W, R F"
Received: "M W, R F, "

[Killed] StringLiteral
src/main/utils/sectionUtils.js:36:16
         index + 1 < timeLocationArray.length &&
         timeLocationArray[index].days !== null
       ) {
-        res += `, `;
+        res += ``;
       }
     }
killedBy: section utils tests formatDays test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M W, R F"
Received: "M WR F"

[Killed] StringLiteral
src/main/utils/sectionUtils.js:55:16
         hhmmTohhmma(timeLocationArray[index].endTime),
       );
       if (index + 1 < timeLocationArray.length) {
-        res += `, `;
+        res += ``;
       }
     }
killedBy: section utils tests formatTime test 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3:30 PM - 4:45 PM, 10:30 AM - 11:45 AM"
Received: "3:30 PM - 4:45 PM10:30 AM - 11:45 AM"

[Killed] BlockStatement
src/main/utils/sectionUtils.js:85:42
 };
 
 //for creating section in table with course status
-export const formatStatus = (section) => {
-  if (section.courseCancelled) return "Cancelled";
-  if (section.classClosed) return "Closed";
-  if (section.enrolledTotal >= section.maxEnroll) return "Full";
-  return "Open";
-};
+export const formatStatus = (section) => {};
 
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  undefined

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:86:7
 
 //for creating section in table with course status
 export const formatStatus = (section) => {
-  if (section.courseCancelled) return "Cancelled";
+  if (false) return "Cancelled";
   if (section.classClosed) return "Closed";
   if (section.enrolledTotal >= section.maxEnroll) return "Full";
killedBy: Section tests all course statuses
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Cancelled
Received:
  Full

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:86:7
 
 //for creating section in table with course status
 export const formatStatus = (section) => {
-  if (section.courseCancelled) return "Cancelled";
+  if (true) return "Cancelled";
   if (section.classClosed) return "Closed";
   if (section.enrolledTotal >= section.maxEnroll) return "Full";
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  Cancelled

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:87:7
 //for creating section in table with course status
 export const formatStatus = (section) => {
   if (section.courseCancelled) return "Cancelled";
-  if (section.classClosed) return "Closed";
+  if (false) return "Closed";
   if (section.enrolledTotal >= section.maxEnroll) return "Full";
   return "Open";
killedBy: Section tests all course statuses
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Closed
Received:
  Full

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:87:7
 //for creating section in table with course status
 export const formatStatus = (section) => {
   if (section.courseCancelled) return "Cancelled";
-  if (section.classClosed) return "Closed";
+  if (true) return "Closed";
   if (section.enrolledTotal >= section.maxEnroll) return "Full";
   return "Open";
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  Closed

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:88:7
 export const formatStatus = (section) => {
   if (section.courseCancelled) return "Cancelled";
   if (section.classClosed) return "Closed";
-  if (section.enrolledTotal >= section.maxEnroll) return "Full";
+  if (section.enrolledTotal < section.maxEnroll) return "Full";
   return "Open";
 };
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  Full

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:88:7
 export const formatStatus = (section) => {
   if (section.courseCancelled) return "Cancelled";
   if (section.classClosed) return "Closed";
-  if (section.enrolledTotal >= section.maxEnroll) return "Full";
+  if (true) return "Full";
   return "Open";
 };
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  Full

[Killed] StringLiteral
src/main/utils/sectionUtils.js:89:10
   if (section.courseCancelled) return "Cancelled";
   if (section.classClosed) return "Closed";
   if (section.enrolledTotal >= section.maxEnroll) return "Full";
-  return "Open";
+  return "";
 };
 
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
