[Killed] BlockStatement
main/pages/CourseDetails/CourseDetailsPage.js:7:45
 import { useParams } from "react-router-dom";
 import { qyyToYyyyq } from "main/utils/quarterUtilities.js";
 
-export default function CourseDetailsPage() {
-  const { qyy, enrollCd } = useParams();
-  const yyyyq = qyy && qyyToYyyyq(qyy.toString());
-
-  const { data: personalSection } = useBackend(
-    // Stryker disable all : hard to test for query caching
-    [`/api/sections/sectionsearch?qtr=${yyyyq}&enrollCode=${enrollCd}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/sections/sectionsearch?qtr=${yyyyq}&enrollCode=${enrollCd}`,
-    },
-  );
-  // Stryker restore all
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Course Details Placeholder Page</h1>
-        {personalSection && <CourseDetailsTable course={[personalSection]} />}
-      </div>
-    </BasicLayout>
-  );
-}
+export default function CourseDetailsPage() {}
 
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: CourseDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] LogicalOperator
main/pages/CourseDetails/CourseDetailsPage.js:25:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details Placeholder Page</h1>
-        {personalSection && <CourseDetailsTable course={[personalSection]} />}
+        {personalSection || <CourseDetailsTable course={[personalSection]} />}
       </div>
     </BasicLayout>
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Invalid data value

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsPage.js:25:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details Placeholder Page</h1>
-        {personalSection && <CourseDetailsTable course={[personalSection]} />}
+        {true}
       </div>
     </BasicLayout>
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
