[Killed] ArrowFunction
main/components/Courses/CourseDetailsTable.js:22:17
     },
     {
       Header: "Enrolled",
-      accessor: (row) => row.classSections[0].enrolledTotal,
+      accessor: () => undefined,
       id: "enrolledTotal",
     },
killedBy: CourseDetailsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  84
Received:

[Killed] ArrowFunction
main/components/Courses/CourseDetailsTable.js:27:17
     },
     {
       Header: "Location",
-      accessor: (row) => row.classSections[0].timeLocations[0].building,
+      accessor: () => undefined,
       id: "building",
     },
killedBy: CourseDetailsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  BUCHN
Received:

[Killed] ArrowFunction
main/components/Courses/CourseDetailsTable.js:37:17
     },
     {
       Header: "Time",
-      accessor: (row) =>
-        row.classSections[0].timeLocations[0].beginTime +
-        "-" +
-        row.classSections[0].timeLocations[0].endTime,
+      accessor: () => undefined,
       id: "time",
     },
killedBy: CourseDetailsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  15:00-15:50
Received:

[Killed] ObjectLiteral
main/components/Courses/CourseDetailsTable.js:43:5
         row.classSections[0].timeLocations[0].endTime,
       id: "time",
     },
-    {
-      Header: "Instructor",
-      accessor: (row) => row.classSections[0].instructors[0].instructor,
-      id: "instructor",
-    },
+    {},
     {
       Header: "Enroll Code",
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Courses/CourseDetailsTable.js:45:17
     },
     {
       Header: "Instructor",
-      accessor: (row) => row.classSections[0].instructors[0].instructor,
+      accessor: () => undefined,
       id: "instructor",
     },
killedBy: CourseDetailsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  WANG L C
Received:

[Killed] ObjectLiteral
main/components/Courses/CourseDetailsTable.js:48:5
       accessor: (row) => row.classSections[0].instructors[0].instructor,
       id: "instructor",
     },
-    {
-      Header: "Enroll Code",
-      accessor: (row) => row.classSections[0].enrollCode,
-      id: "enrollCode",
-    },
+    {},
   ];
 
killedBy: CourseDetailsTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
