[Killed] BooleanLiteral
src/main/components/SectionsTableBase.js:10:15
   columns,
   data,
   testid = "testid",
-  canExpand = true,
+  canExpand = false,
 }) {
   // Stryker disable next-line ObjectLiteral
killedBy: SectionsTableBase tests renders five sections (one with no discussion then lecture with three discussions) correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: ➕. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/SectionsTableBase.js:77:30
                       >
                         {cell.isGrouped ? (
                           <>
-                            {canExpand && (
-                              <span
-                                {...row.getToggleRowExpandedProps()}
-                                data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-expand-symbols`}
-                              >
-                                {row.subRows.length > 1
-                                  ? row.isExpanded
-                                    ? "➖ "
-                                    : "➕ "
-                                  : null}
-                              </span>
-                            )}
+                            {false}
                             {cell.render("Cell")}
                           </>
killedBy: CourseOverTimeInstructorIndexPage tests +/- is displayed for dropdown and works
statusReason: TestingLibraryElementError: Unable to find an element with the text: ➕. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
src/main/components/SectionsTableBase.js:77:30
                       >
                         {cell.isGrouped ? (
                           <>
-                            {canExpand && (
-                              <span
-                                {...row.getToggleRowExpandedProps()}
-                                data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-expand-symbols`}
-                              >
-                                {row.subRows.length > 1
-                                  ? row.isExpanded
-                                    ? "➖ "
-                                    : "➕ "
-                                  : null}
-                              </span>
-                            )}
+                            {canExpand || <span {...row.getToggleRowExpandedProps()} data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-expand-symbols`}>
+                                {row.subRows.length > 1 ? row.isExpanded ? "➖ " : "➕ " : null}
+                              </span>}
                             {cell.render("Cell")}
                           </>
killedBy: CourseOverTimeInstructorIndexPage tests +/- is displayed for dropdown and works
statusReason: TestingLibraryElementError: Unable to find an element with the text: ➕. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
