[Killed] StringLiteral
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.js:12:10
   const [courseJSON, setCourseJSON] = useState([]);
 
   const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/instructorsearch",
+    url: "",
     params: {
       startQtr: query.startQuarter,
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
