[Killed] StringLiteral
main/components/Sections/SectionsTable.js:43:15
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
     {
-      Header: "Section Number",
+      Header: "",
       accessor: (row) => row.section.section,
       id: "sectionNumber",
killedBy: Section tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Section Number. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:67:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Location",
-      accessor: (row) => formatLocation(row.section.timeLocations),
-      id: "location",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Days",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:91:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Instructor",
-      accessor: (row) => formatInstructors(row.section.instructors),
-      id: "instructor",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Enroll Code",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:94:11
     {
       Header: "Instructor",
       accessor: (row) => formatInstructors(row.section.instructors),
-      id: "instructor",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-instructor"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
