[Killed] BooleanLiteral
main/components/Sections/SectionsTable.js:19:63
   return values[0];
 }
 
-export default function SectionsTable({ sections, canExpand = true }) {
+export default function SectionsTable({ sections, canExpand = false }) {
   const navigate = useNavigate();
   const detailsCallback = (cell) => {
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-1-col-courseInfo.courseId-expand-symbols"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:21:37
 
 export default function SectionsTable({ sections, canExpand = true }) {
   const navigate = useNavigate();
-  const detailsCallback = (cell) => {
-    navigate(
-      `/coursedetails/${cell.row.values.quarter}/${cell.row.values.enrollCode}`,
-    );
-  };
+  const detailsCallback = (cell) => {};
 
   const columns = [
killedBy: Section tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/coursedetails/W22/12583"

Number of calls: 0

<html>
  <head />

[Killed] ArithmeticOperator
main/components/Sections/SectionsTable.js:39:57
     {
       Header: "Course ID",
       accessor: "courseInfo.courseId",
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: ({ cell: { value } }) => value.substring(0, value.length + 2),
     },
     {
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:39:13
     {
       Header: "Course ID",
       accessor: "courseInfo.courseId",
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: () => undefined,
     },
     {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:41:5
       accessor: "courseInfo.courseId",
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
     },
-    {
-      Header: "Title",
-      accessor: "courseInfo.title",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:43:17
     },
     {
       Header: "Title",
-      accessor: "courseInfo.title",
+      accessor: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseInfo.title"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:55:5
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
       id: "isSection",
     },
-    {
-      Header: "Enrolled",
-      accessor: (row) =>
-        convertToFraction(row.section.enrolledTotal, row.section.maxEnroll),
-      id: "enrolled",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Status",
killedBy: Section Searches Index Page tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:75:11
     {
       Header: "Location",
       accessor: (row) => formatLocation(row.section.timeLocations),
-      id: "location",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-location"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:81:15
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
     {
-      Header: "Days",
+      Header: "",
       accessor: (row) => formatDays(row.section.timeLocations),
       id: "days",
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Days. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:91:11
     {
       Header: "Time",
       accessor: (row) => formatTime(row.section.timeLocations),
-      id: "time",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-time"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:106:17
     },
     {
       Header: "Enroll Code",
-      accessor: "section.enrollCode",
+      accessor: "",
       id: "enrollCode",
 
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  12583
Received:
  undefined

[Killed] ArrayDeclaration
main/components/Sections/SectionsTable.js:116:25
 
   const testid = "SectionsTable";
 
-  const buttonColumns = [
-    ...columns,
-    ButtonColumn("ⓘ", "primary", detailsCallback, "SectionsTable"),
-  ];
+  const buttonColumns = [];
 
   const columnsToDisplay = buttonColumns;
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
