[Killed] LogicalOperator
main/pages/CourseDetails/CourseDetailsPage.js:25:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details Placeholder Page</h1>
-        {personalSection && !personalSection?.error ? (
+        {personalSection || !personalSection?.error ? (
           <CourseDetailsTable course={[personalSection]} />
         ) : (
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Invalid data value

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsPage.js:25:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details Placeholder Page</h1>
-        {personalSection && !personalSection?.error ? (
+        {true ? (
           <CourseDetailsTable course={[personalSection]} />
         ) : (
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Invalid data value
