[Killed] ArrowFunction
main/components/Courses/CourseDetailsTable.js:13:17
     },
     {
       Header: "Quarter",
-      accessor: (row, _rowIndex) => yyyyqToQyy(row.quarter),
+      accessor: () => undefined,
       id: "quarter",
     },
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W22
Received:

[Killed] StringLiteral
main/components/Courses/CourseDetailsTable.js:14:11
     {
       Header: "Quarter",
       accessor: (row, _rowIndex) => yyyyqToQyy(row.quarter),
-      id: "quarter",
+      id: "",
     },
     {
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-quarter"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/CourseDetailsTable.js:19:11
     {
       Header: "Enroll Code",
       accessor: "classSections[0].enrollCode",
-      id: "enrollCode",
+      id: "",
     },
     {
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-enrollCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/CourseDetailsTable.js:27:18
     },
   ];
 
-  const testid = "CourseDetailsTable";
+  const testid = "";
 
   const columnsToDisplay = columns;
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
