[Timeout] StringLiteral
src/main/utils/quarterUtilities.js:1:39
-const quarters = ["WINTER", "SPRING", "SUMMER", "FALL"];
+const quarters = ["WINTER", "SPRING", "", "FALL"];
 
 const shortQuarters = ["W", "S", "M", "F"];

[Timeout] StringLiteral
src/main/utils/quarterUtilities.js:1:19
-const quarters = ["WINTER", "SPRING", "SUMMER", "FALL"];
+const quarters = ["", "SPRING", "SUMMER", "FALL"];
 
 const shortQuarters = ["W", "S", "M", "F"];

[Killed] StringLiteral
src/main/utils/quarterUtilities.js:3:39
 const quarters = ["WINTER", "SPRING", "SUMMER", "FALL"];
 
-const shortQuarters = ["W", "S", "M", "F"];
+const shortQuarters = ["W", "S", "M", ""];
 
 const qtrNumToQuarter = {
killedBy: Section tests Correctly groups separate quarters of the same class
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W22
Received:
  ➕ 21

[Killed] StringLiteral
src/main/utils/quarterUtilities.js:9:6
   1: "WINTER",
   2: "SPRING",
   3: "SUMMER",
-  4: "FALL",
+  4: "",
 };
 
killedBy: QuarterFormSelect conversion tests qtrNumToQuarter converts property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FALL"
Received: ""

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:12:31
   4: "FALL",
 };
 
-const yyyyqToQyy = (yyyyq) => {
-  return `${shortQuarters[parseInt(yyyyq.charAt(4)) - 1]}${yyyyq.substring(
-    2,
-    4,
-  )}`;
-};
+const yyyyqToQyy = (yyyyq) => {};
 
 const qyyToYyyyq = (qyy) => {
killedBy: QuarterFormSelect conversion tests yyyyqToQyy correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "W21"
Received: undefined

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:13:27
 };
 
 const yyyyqToQyy = (yyyyq) => {
-  return `${shortQuarters[parseInt(yyyyq.charAt(4)) - 1]}${yyyyq.substring(
+  return `${shortQuarters[parseInt(yyyyq.charAt(4)) + 1]}${yyyyq.substring(
     2,
     4,
killedBy: QuarterFormSelect conversion tests yyyyqToQyy correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "W21"
Received: "M21"

[Killed] MethodExpression
src/main/utils/quarterUtilities.js:13:36
 };
 
 const yyyyqToQyy = (yyyyq) => {
-  return `${shortQuarters[parseInt(yyyyq.charAt(4)) - 1]}${yyyyq.substring(
+  return `${shortQuarters[parseInt(yyyyq) - 1]}${yyyyq.substring(
     2,
     4,
killedBy: QuarterFormSelect conversion tests yyyyqToQyy correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "W21"
Received: "undefined21"

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:19:29
   )}`;
 };
 
-const qyyToYyyyq = (qyy) => {
-  const quarter = shortQuarters.indexOf(qyy.charAt(0).toUpperCase()) + 1;
-  const year = `20${qyy.substring(1, 3)}`;
-  return `${year}${quarter}`;
-};
+const qyyToYyyyq = (qyy) => {};
 
 const toFormat = (quarter, year) => {
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:20:19
 };
 
 const qyyToYyyyq = (qyy) => {
-  const quarter = shortQuarters.indexOf(qyy.charAt(0).toUpperCase()) + 1;
+  const quarter = shortQuarters.indexOf(qyy.charAt(0).toUpperCase()) - 1;
   const year = `20${qyy.substring(1, 3)}`;
   return `${year}${quarter}`;
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] MethodExpression
src/main/utils/quarterUtilities.js:20:41
 };
 
 const qyyToYyyyq = (qyy) => {
-  const quarter = shortQuarters.indexOf(qyy.charAt(0).toUpperCase()) + 1;
+  const quarter = shortQuarters.indexOf(qyy.toUpperCase()) + 1;
   const year = `20${qyy.substring(1, 3)}`;
   return `${year}${quarter}`;
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] MethodExpression
src/main/utils/quarterUtilities.js:21:21
 
 const qyyToYyyyq = (qyy) => {
   const quarter = shortQuarters.indexOf(qyy.charAt(0).toUpperCase()) + 1;
-  const year = `20${qyy.substring(1, 3)}`;
+  const year = `20${qyy}`;
   return `${year}${quarter}`;
 };
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Timeout] StringLiteral
src/main/utils/quarterUtilities.js:21:16
 
 const qyyToYyyyq = (qyy) => {
   const quarter = shortQuarters.indexOf(qyy.charAt(0).toUpperCase()) + 1;
-  const year = `20${qyy.substring(1, 3)}`;
+  const year = ``;
   return `${year}${quarter}`;
 };

[Killed] StringLiteral
src/main/utils/quarterUtilities.js:22:10
 const qyyToYyyyq = (qyy) => {
   const quarter = shortQuarters.indexOf(qyy.charAt(0).toUpperCase()) + 1;
   const year = `20${qyy.substring(1, 3)}`;
-  return `${year}${quarter}`;
+  return ``;
 };
 
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:25:37
   return `${year}${quarter}`;
 };
 
-const toFormat = (quarter, year) => {
-  return year.toString() + parseInt(quarter).toString();
-};
+const toFormat = (quarter, year) => {};
 
 const fromFormat = (format) => {
killedBy: QuarterFormSelect conversion tests toFormat correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20211"
Received: undefined

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:26:10
 };
 
 const toFormat = (quarter, year) => {
-  return year.toString() + parseInt(quarter).toString();
+  return year.toString() - parseInt(quarter).toString();
 };
 
killedBy: QuarterFormSelect conversion tests toFormat correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20211"
Received: 2020

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:29:32
   return year.toString() + parseInt(quarter).toString();
 };
 
-const fromFormat = (format) => {
-  return `${quarters[parseInt(format.charAt(4)) - 1]} ${format.substring(
-    0,
-    4,
-  )}`;
-};
+const fromFormat = (format) => {};
 
 const fromNumericYYYYQ = (yyyyqInt) => {
killedBy: QuarterFormSelect conversion tests fromFormat correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WINTER 2021"
Received: undefined

[Killed] MethodExpression
src/main/utils/quarterUtilities.js:30:31
 };
 
 const fromFormat = (format) => {
-  return `${quarters[parseInt(format.charAt(4)) - 1]} ${format.substring(
+  return `${quarters[parseInt(format) - 1]} ${format.substring(
     0,
     4,
killedBy: QuarterFormSelect conversion tests fromFormat correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WINTER 2021"
Received: "undefined 2021"

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:30:22
 };
 
 const fromFormat = (format) => {
-  return `${quarters[parseInt(format.charAt(4)) - 1]} ${format.substring(
+  return `${quarters[parseInt(format.charAt(4)) + 1]} ${format.substring(
     0,
     4,
killedBy: QuarterFormSelect conversion tests fromFormat correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WINTER 2021"
Received: "SUMMER 2021"

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:36:40
   )}`;
 };
 
-const fromNumericYYYYQ = (yyyyqInt) => {
-  if (typeof yyyyqInt != "number") {
-    throw new Error("param should be a number");
-  }
-  const yyyyqStr = yyyyqInt.toString();
-  if (yyyyqStr.length !== 5) {
-    throw new Error("param should be five digits");
-  }
-  const qStr = yyyyqStr.substring(4, 5);
-  if (!(qStr in qtrNumToQuarter)) {
-    throw new Error("param should end in 1,2,3 or 4");
-  }
-  return yyyyqStr;
-};
+const fromNumericYYYYQ = (yyyyqInt) => {};
 
 const toNumericYYYYQ = (yyyyqStr) => {
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly converts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20211"
Received: undefined

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:37:7
 };
 
 const fromNumericYYYYQ = (yyyyqInt) => {
-  if (typeof yyyyqInt != "number") {
+  if (true) {
     throw new Error("param should be a number");
   }
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly converts
statusReason: Error: param should be a number

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:37:7
 };
 
 const fromNumericYYYYQ = (yyyyqInt) => {
-  if (typeof yyyyqInt != "number") {
+  if (false) {
     throw new Error("param should be a number");
   }
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly throws errors
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "param should be a number"

Received function did not throw

[Timeout] StringLiteral
src/main/utils/quarterUtilities.js:38:21
 
 const fromNumericYYYYQ = (yyyyqInt) => {
   if (typeof yyyyqInt != "number") {
-    throw new Error("param should be a number");
+    throw new Error("");
   }
   const yyyyqStr = yyyyqInt.toString();

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:41:7
     throw new Error("param should be a number");
   }
   const yyyyqStr = yyyyqInt.toString();
-  if (yyyyqStr.length !== 5) {
+  if (true) {
     throw new Error("param should be five digits");
   }
killedBy: PersonalSchedulesCreatePage tests renders without crashing
statusReason: Error: param should be five digits

[Killed] EqualityOperator
src/main/utils/quarterUtilities.js:41:7
     throw new Error("param should be a number");
   }
   const yyyyqStr = yyyyqInt.toString();
-  if (yyyyqStr.length !== 5) {
+  if (yyyyqStr.length === 5) {
     throw new Error("param should be five digits");
   }
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly converts
statusReason: Error: param should be five digits

[Killed] MethodExpression
src/main/utils/quarterUtilities.js:44:16
   if (yyyyqStr.length !== 5) {
     throw new Error("param should be five digits");
   }
-  const qStr = yyyyqStr.substring(4, 5);
+  const qStr = yyyyqStr;
   if (!(qStr in qtrNumToQuarter)) {
     throw new Error("param should end in 1,2,3 or 4");
killedBy: PersonalSchedulesCreatePage tests renders without crashing
statusReason: Error: param should end in 1,2,3 or 4

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:45:7
     throw new Error("param should be five digits");
   }
   const qStr = yyyyqStr.substring(4, 5);
-  if (!(qStr in qtrNumToQuarter)) {
+  if (true) {
     throw new Error("param should end in 1,2,3 or 4");
   }
killedBy: PersonalSchedulesCreatePage tests renders without crashing
statusReason: Error: param should end in 1,2,3 or 4

[Killed] BooleanLiteral
src/main/utils/quarterUtilities.js:45:7
     throw new Error("param should be five digits");
   }
   const qStr = yyyyqStr.substring(4, 5);
-  if (!(qStr in qtrNumToQuarter)) {
+  if (qStr in qtrNumToQuarter) {
     throw new Error("param should end in 1,2,3 or 4");
   }
killedBy: PersonalSchedulesCreatePage tests renders without crashing
statusReason: Error: param should end in 1,2,3 or 4

[Killed] StringLiteral
src/main/utils/quarterUtilities.js:46:21
   }
   const qStr = yyyyqStr.substring(4, 5);
   if (!(qStr in qtrNumToQuarter)) {
-    throw new Error("param should end in 1,2,3 or 4");
+    throw new Error("");
   }
   return yyyyqStr;
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly throws errors
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "param should end in 1,2,3 or 4"
Received message:   ""

      116 |       } else {
      117 |         stryCov_9fa48("153");
    > 118 |         throw new Error(stryMutAct_9fa48("154") ? "" : (stryCov_9fa48("154"), "param should end in 1,2,3 or 4"));

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:51:38
   return yyyyqStr;
 };
 
-const toNumericYYYYQ = (yyyyqStr) => {
-  if (typeof yyyyqStr !== "string") {
-    throw new Error("param should be a string");
-  }
-  if (yyyyqStr.length !== 5) {
-    throw new Error("param should be five digits");
-  }
-  const qStr = yyyyqStr.substring(4, 5);
-  if (!(qStr in qtrNumToQuarter)) {
-    throw new Error("param should end in 1,2,3 or 4");
-  }
-  return parseInt(yyyyqStr);
-};
+const toNumericYYYYQ = (yyyyqStr) => {};
 
 const nextQuarter = (yyyyqInt) => {
killedBy: PersonalSchedulesCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'yyyyq')

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:52:7
 };
 
 const toNumericYYYYQ = (yyyyqStr) => {
-  if (typeof yyyyqStr !== "string") {
+  if (false) {
     throw new Error("param should be a string");
   }
killedBy: QuarterFormSelect conversion tests toNumericYYYYQ correctly throws errors
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "param should be a string"
Received message:   "param should be five digits"

      140 |       } else {
      141 |         stryCov_9fa48("165");
    > 142 |         throw new Error(stryMutAct_9fa48("166") ? "" : (stryCov_9fa48("166"), "param should be five digits"));

[Killed] EqualityOperator
src/main/utils/quarterUtilities.js:52:7
 };
 
 const toNumericYYYYQ = (yyyyqStr) => {
-  if (typeof yyyyqStr !== "string") {
+  if (typeof yyyyqStr === "string") {
     throw new Error("param should be a string");
   }
killedBy: QuarterFormSelect conversion tests toNumericYYYYQ correctly converts
statusReason: Error: param should be a string

[Killed] EqualityOperator
src/main/utils/quarterUtilities.js:55:7
   if (typeof yyyyqStr !== "string") {
     throw new Error("param should be a string");
   }
-  if (yyyyqStr.length !== 5) {
+  if (yyyyqStr.length === 5) {
     throw new Error("param should be five digits");
   }
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Error: param should be five digits

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:55:7
   if (typeof yyyyqStr !== "string") {
     throw new Error("param should be a string");
   }
-  if (yyyyqStr.length !== 5) {
+  if (true) {
     throw new Error("param should be five digits");
   }
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Error: param should be five digits

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:59:7
     throw new Error("param should be five digits");
   }
   const qStr = yyyyqStr.substring(4, 5);
-  if (!(qStr in qtrNumToQuarter)) {
+  if (false) {
     throw new Error("param should end in 1,2,3 or 4");
   }
killedBy: QuarterFormSelect conversion tests toNumericYYYYQ correctly throws errors
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "param should end in 1,2,3 or 4"

Received function did not throw

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:65:35
   return parseInt(yyyyqStr);
 };
 
-const nextQuarter = (yyyyqInt) => {
-  const _yyyyqStr = fromNumericYYYYQ(yyyyqInt); // just for type/format checking
-  const qInt = yyyyqInt % 10;
-  const yyyyInt = Math.floor(yyyyqInt / 10);
-  if (qInt < 4) {
-    return yyyyqInt + 1;
-  }
-  return (yyyyInt + 1) * 10 + 1;
-};
+const nextQuarter = (yyyyqInt) => {};
 
 const quarterRange = (beginYYYYQStr, endYYYYQStr) => {
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: TestingLibraryElementError: Value "20222" not found in options

Ignored nodes: comments, <script />, <style />
<select
  class="form-control"
  id="CourseOverTimeBuildingsSearch.StartQuarter"
>
  <option

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:67:16
 
 const nextQuarter = (yyyyqInt) => {
   const _yyyyqStr = fromNumericYYYYQ(yyyyqInt); // just for type/format checking
-  const qInt = yyyyqInt % 10;
+  const qInt = yyyyqInt * 10;
   const yyyyInt = Math.floor(yyyyqInt / 10);
   if (qInt < 4) {
killedBy: QuarterFormSelect conversion tests nextQuarter correctly increments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20212
Received: 20221

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:68:30
 const nextQuarter = (yyyyqInt) => {
   const _yyyyqStr = fromNumericYYYYQ(yyyyqInt); // just for type/format checking
   const qInt = yyyyqInt % 10;
-  const yyyyInt = Math.floor(yyyyqInt / 10);
+  const yyyyInt = Math.floor(yyyyqInt * 10);
   if (qInt < 4) {
     return yyyyqInt + 1;
killedBy: QuarterFormSelect conversion tests nextQuarter correctly increments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20221
Received: 2021411

[Killed] EqualityOperator
src/main/utils/quarterUtilities.js:69:7
   const _yyyyqStr = fromNumericYYYYQ(yyyyqInt); // just for type/format checking
   const qInt = yyyyqInt % 10;
   const yyyyInt = Math.floor(yyyyqInt / 10);
-  if (qInt < 4) {
+  if (qInt >= 4) {
     return yyyyqInt + 1;
   }
killedBy: CourseOverTimeSearchForm tests when I select an end quarter, the state for end quarter changes
statusReason: TestingLibraryElementError: Value "20204" not found in options

Ignored nodes: comments, <script />, <style />
<select
  class="form-control"
  id="CourseOverTimeSearch.EndQuarter"
>
  <option

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:69:7
   const _yyyyqStr = fromNumericYYYYQ(yyyyqInt); // just for type/format checking
   const qInt = yyyyqInt % 10;
   const yyyyInt = Math.floor(yyyyqInt / 10);
-  if (qInt < 4) {
+  if (true) {
     return yyyyqInt + 1;
   }
killedBy: QuarterFormSelect conversion tests nextQuarter correctly increments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20221
Received: 20215

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:70:12
   const qInt = yyyyqInt % 10;
   const yyyyInt = Math.floor(yyyyqInt / 10);
   if (qInt < 4) {
-    return yyyyqInt + 1;
+    return yyyyqInt - 1;
   }
   return (yyyyInt + 1) * 10 + 1;
killedBy: CourseOverTimeSearchForm tests renders without crashing
statusReason: Error: param should end in 1,2,3 or 4

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:72:10
   if (qInt < 4) {
     return yyyyqInt + 1;
   }
-  return (yyyyInt + 1) * 10 + 1;
+  return (yyyyInt + 1) / 10 + 1;
 };
 
killedBy: CourseOverTimeSearchForm tests when I select a start quarter, the state for start quarter changes
statusReason: Error: param should be five digits

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:72:10
   if (qInt < 4) {
     return yyyyqInt + 1;
   }
-  return (yyyyInt + 1) * 10 + 1;
+  return (yyyyInt + 1) * 10 - 1;
 };
 
killedBy: CourseOverTimeSearchForm tests when I select a start quarter, the state for start quarter changes
statusReason: Error: param should end in 1,2,3 or 4

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:75:54
   return (yyyyInt + 1) * 10 + 1;
 };
 
-const quarterRange = (beginYYYYQStr, endYYYYQStr) => {
-  let quarterList = [];
-  const beginYYYYQInt = toNumericYYYYQ(beginYYYYQStr);
-  const endYYYYQInt = toNumericYYYYQ(endYYYYQStr);
-  for (
-    let yyyyqInt = beginYYYYQInt;
-    yyyyqInt <= endYYYYQInt;
-    yyyyqInt = nextQuarter(yyyyqInt)
-  ) {
-    const yyyyqStr = fromNumericYYYYQ(yyyyqInt);
-    quarterList.push({
-      yyyyq: yyyyqStr,
-      qyy: yyyyqToQyy(yyyyqStr),
-    });
-  }
-  return quarterList;
-};
+const quarterRange = (beginYYYYQStr, endYYYYQStr) => {};
 
 export {
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/main/utils/quarterUtilities.js:81:5
   const endYYYYQInt = toNumericYYYYQ(endYYYYQStr);
   for (
     let yyyyqInt = beginYYYYQInt;
-    yyyyqInt <= endYYYYQInt;
+    yyyyqInt > endYYYYQInt;
     yyyyqInt = nextQuarter(yyyyqInt)
   ) {
killedBy: CourseOverTimeSearchForm tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'yyyyq')

[Killed] EqualityOperator
src/main/utils/quarterUtilities.js:81:5
   const endYYYYQInt = toNumericYYYYQ(endYYYYQStr);
   for (
     let yyyyqInt = beginYYYYQInt;
-    yyyyqInt <= endYYYYQInt;
+    yyyyqInt < endYYYYQInt;
     yyyyqInt = nextQuarter(yyyyqInt)
   ) {
killedBy: CourseOverTimeSearchForm tests when I click submit, the right stuff happens
statusReason: TestingLibraryElementError: Value "20214" not found in options

Ignored nodes: comments, <script />, <style />
<select
  class="form-control"
  id="CourseOverTimeSearch.EndQuarter"
>
  <option

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:83:5
     let yyyyqInt = beginYYYYQInt;
     yyyyqInt <= endYYYYQInt;
     yyyyqInt = nextQuarter(yyyyqInt)
-  ) {
-    const yyyyqStr = fromNumericYYYYQ(yyyyqInt);
-    quarterList.push({
-      yyyyq: yyyyqStr,
-      qyy: yyyyqToQyy(yyyyqStr),
-    });
-  }
+  ) {}
   return quarterList;
 };
killedBy: CourseOverTimeInstructorIndexPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'yyyyq')
