[Killed] LogicalOperator
main/pages/CourseDetails/CourseDetailsPage.js:9:17
 
 export default function CourseDetailsPage() {
   const { qyy, enrollCd } = useParams();
-  const yyyyq = qyy && qyyToYyyyq(qyy.toString());
+  const yyyyq = qyy || qyyToYyyyq(qyy.toString());
 
   const { data: personalSection } = useBackend(
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsPage.js:9:17
 
 export default function CourseDetailsPage() {
   const { qyy, enrollCd } = useParams();
-  const yyyyq = qyy && qyyToYyyyq(qyy.toString());
+  const yyyyq = false;
 
   const { data: personalSection } = useBackend(
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/CourseDetails/CourseDetailsPage.js:25:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details Placeholder Page</h1>
-        {personalSection && !personalSection.error ? (
+        {personalSection || !personalSection.error ? (
           <CourseDetailsTable course={[personalSection]} />
         ) : (
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: TypeError: Cannot read properties of undefined (reading 'error')

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsPage.js:25:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details Placeholder Page</h1>
-        {personalSection && !personalSection.error ? (
+        {true ? (
           <CourseDetailsTable course={[personalSection]} />
         ) : (
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Invalid data value
