[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:41:7
     throw new Error("param should be a number");
   }
   const yyyyqStr = yyyyqInt.toString();
-  if (yyyyqStr.length !== 5) {
+  if (false) {
     throw new Error("param should be five digits");
   }
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly throws errors
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "param should be five digits"
Received message:   "param should end in 1,2,3 or 4"

      116 |       } else {
      117 |         stryCov_9fa48("155");
    > 118 |         throw new Error(stryMutAct_9fa48("156") ? "" : (stryCov_9fa48("156"), "param should end in 1,2,3 or 4"));

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:55:30
   if (typeof yyyyqStr !== "string") {
     throw new Error("param should be a string");
   }
-  if (yyyyqStr.length !== 5) {
-    throw new Error("param should be five digits");
-  }
+  if (yyyyqStr.length !== 5) {}
   const qStr = yyyyqStr.substring(4, 5);
   if (!(qStr in qtrNumToQuarter)) {
killedBy: QuarterFormSelect conversion tests toNumericYYYYQ correctly throws errors
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "param should be five digits"
Received message:   "param should end in 1,2,3 or 4"

      149 |       } else {
      150 |         stryCov_9fa48("173");
    > 151 |         throw new Error(stryMutAct_9fa48("174") ? "" : (stryCov_9fa48("174"), "param should end in 1,2,3 or 4"));
