[Killed] MethodExpression
src/main/utils/quarterUtilities.js:20:41
 };
 
 const qyyToYyyyq = (qyy) => {
-  const quarter = shortQuarters.indexOf(qyy.charAt(0).toUpperCase()) + 1;
+  const quarter = shortQuarters.indexOf(qyy.charAt(0).toLowerCase()) + 1;
   const year = `20${qyy.substring(1, 3)}`;
   return `${year}${quarter}`;
killedBy: CourseDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
